[
  {
    "ruta": "/aplicacion/sensores/temperatura",
    "imagenes": [
      {
        "ruta": "../../../../assets/img/dht11.jpg"
      },
      {
        "ruta": "../../../../assets/img/dht11.jpg"
      }
    ],
    "texto": [
      {
        "parrafo": "En este caso se utiliza el sensor DHT 11 que es ampliamente utilizado para medir la temperatura ambiente. Este sensor digital de bajo costo es conocido por su precisión y facilidad de uso. A través de su componente de termistor, el DHT11 detecta la temperatura del entorno en el que se encuentra y la convierte en una señal digital que puede ser leída por microcontroladores, como Arduino, Raspberry Pi y otros dispositivos electrónicos."
      }
    ]
  },
  {
    "ruta": "/aplicacion/sensores/humedad",
    "imagenes": [
      {
        "ruta": "../../../../assets/img/dht11.jpg"
      },
      {
        "ruta": "../../../../assets/img/dht11.jpg"
      }
    ],
    "texto": [
      {
        "parrafo": "El sensor DHT11 es un dispositivo ampliamente utilizado para medir la humedad relativa del aire en su entorno. Este sensor digital de bajo costo se destaca por su precisión y facilidad de uso en aplicaciones que requieren el monitoreo de la humedad del aire. El DHT11 utiliza un sensor capacitivo para medir la humedad relativa y luego convierte esa lectura en una señal digital que puede ser fácilmente interpretada por microcontroladores y otros dispositivos electrónicos. "
      }
    ]
  },
  {
    "ruta": "/aplicacion/sensores/luz",
    "imagenes": [
      {
        "ruta": "../../../../assets/img/fotoresistencia.jpg"
      },
      {
        "ruta": "../../../../assets/img/fotoresistencia.jpg"
      }
    ],
    "texto": [
      {
        "parrafo": "Una fotoresistencia, también conocida como LDR (Light-Dependent Resistor), es un componente electrónico sensible a la luz que cambia su resistencia eléctrica en respuesta a la cantidad de luz que incide sobre ella. Cuanta menos luz recibe, mayor es su resistencia, y viceversa. Este dispositivo se utiliza comúnmente en aplicaciones de control automático, como sensores de luz en sistemas de iluminación, exposímetros de cámaras, y en circuitos que requieren detección de luz para activar o desactivar funciones automáticamente. La fotoresistencia es útil para detectar niveles de luz ambiental y ajustar dispositivos o sistemas en consecuencia, lo que la hace valiosa en una variedad de aplicaciones que requieren control basado en la luminosidad del entorno."
      }
    ]
  },
  {
    "ruta": "/aplicacion/sensores/aire",
    "imagenes": [
      {
        "ruta": "../../../../assets/img/mq135.jpg"
      },
      {
        "ruta": "../../../../assets/img/mq135.jpg"
      }
    ],
    "texto": [
      {
        "parrafo": "El sensor MQ-135 es un sensor de gas que se utiliza para detectar y medir la concentración de varios gases en el aire, como monóxido de carbono (CO), dióxido de carbono (CO2), amoníaco (NH3), metano (CH4) y otros gases peligrosos. Es ampliamente utilizado en aplicaciones de seguridad y calidad del aire, así como en proyectos de monitoreo ambiental. El sensor MQ-135 opera en función de la resistencia eléctrica que cambia en respuesta a la presencia y concentración de gases específicos. La lectura de resistencia se convierte en una señal eléctrica que puede ser interpretada para determinar la concentración de gases peligrosos en el aire. Este sensor es útil en sistemas de detección de gases tóxicos, control de calidad del aire en interiores, y proyectos de seguridad y automatización. Su versatilidad y capacidad para detectar múltiples gases lo hacen valioso en una variedad de aplicaciones relacionadas con la seguridad y el monitoreo ambiental."
      }
    ]
  },
  {
    "ruta": "/aplicacion/actuadores/camara_r",
    "imagenes": [
      {
        "ruta": "../../../../assets/img/raspicam.jpg"
      },
      {
        "ruta": "../../../../assets/img/raspicam.jpg"
      }
    ],
    "texto": [
      {
        "parrafo": "La Raspicam se refiere a una cámara diseñada específicamente para su uso con las placas Raspberry Pi, como la Raspberry Pi 3. Es un módulo de cámara de alta calidad que se conecta directamente a los puertos de la Raspberry Pi y permite a los usuarios capturar imágenes y videos de alta resolución de manera sencilla y eficiente. En este proyecto, la Raspicam actúa como una cámara IP, permitiendo la transmisión y visualización de imágenes o videos en tiempo real a través de una red, lo que facilita el monitoreo remoto y la grabación de contenido desde la Raspberry Pi."
      }
    ]
  },
  {
    "ruta": "/aplicacion/actuadores/luces",
    "imagenes": [
      {
        "ruta": "../../../../assets/img/led1.jpeg"
      },
      {
        "ruta": "../../../../assets/img/led1.jpeg"
      }
    ],
    "texto": [
      {
        "parrafo": "En el contexto de IoT (Internet de las cosas), los LEDs se utilizan para indicar el estado de dispositivos o sensores, así como para proporcionar retroalimentación visual en aplicaciones de control de luces. Los LEDs pueden ser controlados de forma remota a través de una red, lo que permite encender, apagar o ajustar su brillo de manera programada o en respuesta a eventos específicos. Esto facilita el monitoreo y el control de la iluminación en aplicaciones de automatización del hogar, gestión de edificios, agricultura inteligente y otros escenarios de IoT."
      }
    ]
  },
  {
    "ruta": "/aplicacion/actuadores/puerta",
    "imagenes": [
      {
        "ruta": "../../../../assets/img/sg90.jpeg"
      },
      {
        "ruta": "../../../../assets/img/sg90.jpeg"
      }
    ],
    "texto": [
      {
        "parrafo": "El actuador SG90 es un pequeño servo motor ampliamente utilizado en proyectos de robótica y automatización, incluidas las aplicaciones de IoT (Internet de las cosas). Este servo motor se utiliza para controlar el movimiento de puertas, ventanas, brazos robóticos y otros componentes mecánicos en maquetas y dispositivos. En el contexto de la maqueta domótica, el SG90 se utiliza para accionar la puerta, permitiendo abrir y cerrar la puerta de manera controlada y precisa."
      }
    ]
  }
]