[
    {
        "ruta": "/wikiiot/leccion2",
        "info": {
            "introduccion": [
                "Los actuadores y sensores son los protagonistas invisibles pero esenciales en nuestra vida cotidiana, permitiéndonos explorar nuevas fronteras tecnológicas y transformar nuestras ideas en realidades palpables. En la maqueta encontraremos varios de estos.",
                "A continuación hablaremos un poquito mas sobre cada uno."
            ]
        },
        "tabs": [
            {
                "titulo": "Sensores",
                "texto": [
                    "Un sensor es un dispositivo tecnológico esencial que recopila datos sobre diversas condiciones del entorno, como clima, temperatura, movimiento y presencia de personas. Estos datos son vitales para los sistemas de automatización del hogar y el Internet de las cosas (IoT), ya que permiten que los dispositivos tomen decisiones y realicen acciones en respuesta a las condiciones detectadas."
                ]
            },
            {
                "titulo": "Actuadores",
                "texto": [
                    "Un actuador es un dispositivo que responde a señales o comandos realizando acciones físicas, como abrir puertas o encender dispositivos. Son vitales en sistemas de automatización, permitiendo que los sistemas tomen decisiones y realicen tareas físicas específicas en el mundo real."
                ]
            }
        ]
    },
    {
        "ruta": "/wikiiot/leccion2/1",
        "info": {
            "titulo": "Sensores",
            "texto": [
                "Un sensor es un dispositivo tecnológico esencial que recopila datos sobre diversas condiciones del entorno, como clima, temperatura, movimiento y presencia de personas. Estos datos son vitales para los sistemas de automatización del hogar y el Internet de las cosas (IoT), ya que permiten que los dispositivos tomen decisiones y realicen acciones en respuesta a las condiciones detectadas."
            ]
        }
    },
    {
        "ruta": "/wikiiot/leccion2/2",
        "info": {
            "titulo": "Actuadores",
            "texto": [
                "Un actuador es un dispositivo que responde a señales o comandos realizando acciones físicas, como abrir puertas o encender dispositivos. Son vitales en sistemas de automatización, permitiendo que los sistemas tomen decisiones y realicen tareas físicas específicas en el mundo real."
            ]
        }
    },
    {
        "ruta": "/wikiiot/leccion3",
        "info": {
            "introduccion": [
                "Para entender como los componentes se comunican y como podemos interactuar con estos, tenemos que conocer la tecnología que esta detrás de esto y como estos nos ayudan a nuestro objetivo."
            ]
        }
    },
    {
        "ruta": "/wikiiot/leccion3/1",
        "info": {
            "titulo": "MQTT (Message Queuing Telemetry Transport)",
            "texto": [
                "MQTT es un protocolo de mensajería ligero y eficiente diseñado para la comunicación en redes IoT (Internet de las Cosas) y otras aplicaciones en las que se requiere la transferencia de datos entre dispositivos con ancho de banda y recursos limitados. Fue desarrollado por IBM en la década de 1990 y se ha convertido en un estándar ampliamente utilizado en el mundo de IoT."
            ],
            "caracteristicas": [
                "Ligereza",
                "Publicación/Suscripción",
                "Calidad de Servicio",
                "Retención de Mensajes",
                "Conexiones Duraderas",
                "Baja Latencia"
            ]
        }
    },
    {
        "ruta": "/wikiiot/leccion3/2",
        "info": {
            "titulo": "Broker",
            "texto": [
                "El broker es un componente clave en el protocolo MQTT y desempeña un papel fundamental en la comunicación entre dispositivos en una red IoT. En el contexto de MQTT:"
            ],
            "definiciones": [
                {
                    "titulo": "Gestión de Mensajes",
                    "texto": "El broker MQTT es responsable de recibir todos los mensajes publicados por los dispositivos y enrutarlos correctamente a los clientes suscritos que estén interesados en esos mensajes. Actúa como un intermediario que gestiona y distribuye la información."
                },
                {
                    "titulo": "Publicación/Suscripción",
                    "texto": "El broker facilita el modelo de publicación/suscripción, donde los dispositivos pueden publicar mensajes en ciertos temas y los clientes interesados (suscriptores) pueden suscribirse a temas específicos para recibir los mensajes pertinentes. El broker garantiza que los mensajes se entreguen a los suscriptores adecuados."
                },
                {
                    "titulo": "Gestión de Conexiones",
                    "texto": "El broker administra las conexiones entrantes de los dispositivos y clientes MQTT. Permite conexiones duraderas, lo que significa que los clientes pueden desconectarse y luego reconectarse. También gestiona las suscripciones y desuscripciones de los clientes a los temas."
                },
                {
                    "titulo": "Control de Acceso y Seguridad",
                    "texto": "Algunos brokers MQTT ofrecen funciones de control de acceso y seguridad, permitiendo autorizar qué dispositivos o clientes tienen permiso para publicar o suscribirse a ciertos temas. Esto es crucial para garantizar la integridad y la seguridad de los datos en la red."
                }
            ]
        }
    },
    {
        "ruta": "/wikiiot/leccion4",
        "info": {
            "introduccion": [
                "La casa, como podemos ver, cuenta con una serie de sensores y actuadores como también una cámara.",
                "También nos encontramos con dos componentes importantes: la ESP32 y la Raspberry Pi.",
                "Aquí describiremos con detalle cada uno."
            ]
        }
    },
    {
        "ruta": "/wikiiot/leccion4/1",
        "info": {
            "titulo": "ESP32",
            "texto": [
                "La ESP32 es un microcontrolador versátil y económico que combina Wi-Fi y Bluetooth en un solo chip. Es ampliamente utilizado en proyectos de Internet de las Cosas (IoT), automatización del hogar y dispositivos electrónicos portátiles debido a su bajo costo, bajo consumo de energía y capacidades avanzadas. Es popular en la comunidad de desarrolladores debido a su versatilidad y amplio soporte."
            ]
        },
        "infoExtra": {
            "titulo": "¿Cuál es la función dentro de esta maqueta?",
            "texto": [
                "Tanto los sensores como los actuadores están conectados directamente en la ESP32, a través la cual permite la conexión con el resto de la interfaz, tanto para la comunicación como el control de estos, gracias al WiFi del microcontrolador."
            ]
        }
    },
    {
        "ruta": "/wikiiot/leccion4/2",
        "info": {
            "titulo": "Raspberry Pi",
            "texto": [
                "La Raspberry Pi es una computadora de placa única de bajo costo, diseñada para la educación y proyectos caseros. Es pequeña pero poderosa, con capacidad para ejecutar sistemas operativos como Linux. Se utiliza para aprender programación, navegación por internet, proyectos de automatización y mucho más, siendo popular entre estudiantes y aficionados."
            ]
        },
        "infoExtra": {
            "titulo": "¿Cuál es la función dentro de esta maqueta?",
            "texto": [
                "En este proyecto proporciona una red, la cual estamos conectados, y proporciona un servidor para este sitio web, como también plataforma para que el broker pueda funcionar y asi brindar la comunicación entre esta aplicación y los dispositivos conectados a esta.",
                "También la Raspicam está conectada a esta, la cual también permite la visualización de este en esta interfaz."
            ]
        }
    },
    {
        "ruta": "/wikiiot/leccion4/3",
        "info": {
            "titulo": "RaspiCam",
            "texto": [
                "La Raspberry Pi Camera Module es una cámara de alta calidad que se conecta a la Raspberry Pi. Puede tomar fotos y videos de alta definición, así como imágenes de lapso de tiempo. Es una opción popular para proyectos de automatización del hogar, seguridad y vigilancia, y fotografía."
            ]
        },
        "infoExtra": {
            "titulo": "¿Cuál es la función dentro de esta maqueta?",
            "texto": [
                "En este proyecto, la Raspicam actúa como una cámara IP, permitiendo la transmisión y visualización de imágenes o videos en tiempo real a través de una red, lo que facilita el monitoreo remoto y la grabación de contenido desde la Raspberry Pi."
            ]
        }
    },
    {
        "ruta": "/wikiiot/leccion4/4",
        "info": {
            "titulo": "Actuadores",
            "texto": []
        },
        "subInfo": [
            {
                "titulo": "Leds",
                "texto": [
                    "En el contexto de IoT (Internet de las cosas), los LEDs se utilizan para indicar el estado de dispositivos o sensores, así como para proporcionar retroalimentación visual en aplicaciones de control de luces. Los LEDs pueden ser controlados de forma remota a través de una red, lo que permite encender, apagar o ajustar su brillo de manera programada o en respuesta a eventos específicos. Esto facilita el monitoreo y el control de la iluminación en aplicaciones de automatización del hogar, gestión de edificios, agricultura inteligente y otros escenarios de IoT."
                ]
            },
            {
                "titulo": "Servo-motor",
                "texto": [
                    "El actuador SG90 es un pequeño servo motor ampliamente utilizado en proyectos de robótica y automatización, incluidas las aplicaciones de IoT (Internet de las cosas). Este servo motor se utiliza para controlar el movimiento de puertas, ventanas, brazos robóticos y otros componentes mecánicos en maquetas y dispositivos.",
                    "En el contexto de la maqueta domótica, el SG90 se utiliza para accionar la puerta, permitiendo abrir y cerrar la puerta de manera controlada y precisa."
                ]
            }
        ]
    },
    {
        "ruta": "/wikiiot/leccion4/5",
        "info": {
            "titulo": "Sensores",
            "texto": []
        },
        "subInfo": [
            {
                "titulo": "Temperatura y Presión Atmosférica",
                "texto": [
                    "En este caso se utiliza el sensor DHT 11 que es ampliamente utilizado, por su bajo costo, para medir la temperatura ambiente y presión atmosférica. A través de su componente de termistor, el DHT11 detecta la temperatura y la presión atmosférica del entorno en el que se encuentra y la convierte en una señal digital que puede ser leída por microcontroladores, como Arduino, Raspberry Pi y otros dispositivos electrónicos."
                ]
            },
            {
                "titulo": "Intensidad Lumínica",
                "texto": [
                    "Una fotoresistencia, también conocida como LDR (Light-Dependent Resistor), es un componente electrónico sensible a la luz que cambia su resistencia eléctrica en respuesta a la cantidad de luz que incide sobre ella. Cuanta menos luz recibe, mayor es su resistencia, y viceversa. Este dispositivo se utiliza comúnmente en aplicaciones de control automático, como sensores de luz en sistemas de iluminación, exposímetros de cámaras, y en circuitos que requieren detección de luz para activar o desactivar funciones automáticamente. La fotoresistencia es útil para detectar niveles de luz ambiental y ajustar dispositivos o sistemas en consecuencia, lo que la hace valiosa en una variedad de aplicaciones que requieren control basado en la luminosidad del entorno."
                ]
            },
            {
                "titulo": "Calidad de Aire",
                "texto": [
                    "El sensor MQ-135 es un sensor de gas que se utiliza para detectar y medir la concentración de varios gases en el aire, como monóxido de carbono (CO), dióxido de carbono (CO2), amoníaco (NH3), metano (CH4) y otros gases peligrosos. Es ampliamente utilizado en aplicaciones de seguridad y calidad del aire, así como en proyectos de monitoreo ambiental. El sensor MQ-135 opera en función de la resistencia eléctrica que cambia en respuesta a la presencia y concentración de gases específicos. La lectura de resistencia se convierte en una señal eléctrica que puede ser interpretada para determinar la concentración de gases peligrosos en el aire. Este sensor es útil en sistemas de detección de gases tóxicos, control de calidad del aire en interiores, y proyectos de seguridad y automatización."
                ]
            }
        ]
    },
    {
        "ruta": "/wikiiot/leccion5",
        "info": {
            "introduccion": [
                "Cada sensor y actuador conectado en la ESP32, en donde:"
            ]
        }
    },
    {
        "ruta": "/wikiiot/leccion6",
        "info": {
            "introduccion": [
                "Aqui puedes revisar algunos ejemplos de proyectos..."
            ]
        }
    }
]