[
    {
        "ruta": "/wikiiot/leccion1",
        "titulo2": "Introducción al IoT y a Home Automation Wizard",
        "objetivos": [
            {
                "texto": "Comprender qué es el Internet de las Cosas (IoT) y cómo está revolucionando la automatización del hogar y otros campos."
            },
            {
                "texto": "Conocer cómo Home Automation Wizard permite a los usuarios controlar y monitorear una maqueta de casa inteligente a través de la aplicación."
            },
            {
                "texto": "Aprender los conceptos básicos para convertirse en un 'mago' de la automatización del hogar."
            }
        ]
    },
    {
        "ruta": "/wikiiot/leccion1/contenido/1",
        "titulo2": "¿Qué es el IoT?",
        "imagenes": [
            "../../../../assets/img/iot.webp"
        ],
        "texto": "El Internet de las Cosas, o IoT, se refiere a la red de dispositivos físicos conectados a Internet que recopilan y comparten datos para automatizar tareas y tomar decisiones informadas. IoT es una tecnología que ha revolucionado la forma en que interactuamos con el mundo digital y físico. Su importancia en la vida cotidiana es cada vez más evidente, ya que permite la interconexión de dispositivos y sistemas para mejorar la eficiencia, la comodidad y la toma de decisiones."
    },
    {
        "ruta": "/wikiiot/leccion1/contenido/2",
        "titulo2": "¿Qué es Home Automation Wizard?",
        "imagenes": [
            "../../../../assets/img/casa.jpeg"
        ],
        "texto": "Home Automation Wizard es una aplicación móvil educativa y práctica diseñada para enseñar a los usuarios sobre el Internet de las Cosas (IoT) y la automatización del hogar de una manera interactiva y divertida. Esta aplicación proporciona a los usuarios una experiencia de aprendizaje única, permitiéndoles explorar y controlar una maqueta de casa inteligente a través de su dispositivo móvil."
    },
    {   "ruta":"/wikiiot/leccion2/contenido/1",
        "titulo2": "Sensores",
        "imagenes": [
            "../../../../assets/img/casa.jpeg"
        ],
        "texto": "Un sensor es un componente tecnológico que se utiliza para recopilar datos y medir condiciones específicas del entorno. Estos datos pueden incluir información sobre el clima, la iluminación, la temperatura, la humedad, el movimiento, la presencia de personas y una amplia variedad de otros parámetros. Los sensores son una parte fundamental de los sistemas de automatización del hogar y del IoT, ya que permiten que los dispositivos y sistemas tomen decisiones informadas y realicen acciones en función de las condiciones detectadas."
    },
    {
        "ruta":"/wikiiot/leccion2/contenido/2",
        "titulo2":"Actuadores",
        "imagenes":[
            "../../../../assets/img/iot.webp"
        ],
        "texto":"Un actuador es un componente o dispositivo que realiza acciones físicas o mecánicas en respuesta a señales o comandos recibidos. Estas acciones pueden incluir, por ejemplo, abrir o cerrar una puerta, encender o apagar un dispositivo, ajustar la posición de una persiana, mover un motor, o realizar otras tareas físicas específicas. Los actuadores son esenciales en sistemas de automatización y control, permitiendo que los sistemas tomen decisiones y ejecuten acciones en el mundo real."
    },
    {
        "ruta":"/wikiiot/leccion3/contenido/1",
        "titulo2":"MQTT (Message Queuing Telemetry Transport)",
        "imagenes":[
            "../../../../assets/img/iot.webp"
        ],
        "texto":"MQTT es un protocolo de mensajería ligero y eficiente diseñado para la comunicación en redes IoT (Internet de las Cosas) y otras aplicaciones en las que se requiere la transferencia de datos entre dispositivos con ancho de banda y recursos limitados. Fue desarrollado por IBM en la década de 1990 y se ha convertido en un estándar ampliamente utilizado en el mundo de IoT.",
        "caracteristicas":[
            "Ligereza",
            "Publicación/Suscripción (Publish/Subscribe)",
            "Calidad de Servicio (QoS)",
            "Retención de Mensajes",
            "Conexiones Duraderas",
            "Baja Latencia"
        ]
    }
]